{
  "HEADER": "I am",
  "FRONDENDH2": "Frontend Developer",
  "BUTTON": "Let´s talk!",
  "ABOUTH1": "About me",
  "TEXT1": "Hi, I am a Front-end developer based in Altenkirchenand I´m 29 years old. I gained my experience through training at the TÜV-certified Developer Akademie GmbH.",
  "TEXT2": "I really enjoy finding creative and effective solutions for designing digital experiences. The diversity and dynamism of programming inspires me every day.",
  "TEXT3": "I am disciplined and have a logical understanding that helps me deal with even more complex problems. Feel free to check out my projects to get an idea of ​​what I've been working on.",
  "SKILLS-h1": "My skills",
  "SKILLS-p": "I have grown my frontend developments skills that have allowed me to create different real projects.",
  "SKILLS-BTN": "Get in touch",
  "PORTFOLIO-TEXT1": "Explore a selection of my work here - Interact width projects to see my skills in action.",
  "CONTACT-h1": "Contact",
  "CONTACT-h2": "Got a problem to solve?",
  "CONTACT-TEXT1": "Contact me through this form, I am interested in hearing from you, knowing your ideas and contributing to your projects with my work.",
  "CONTACT-TEXT2": "Need a Frontend developer?",
  "CONTACT-TEXT3": "Contact me!",
  "accept": "I accept the",
  "privacy": "privacy policy",
  "mailSend": "Mail send",
  "imprint": "imprint",
  "angaben-paragraph": "Entries referred to",
  "represented": "Represented by",
  "imprint-kontact": "Contact",
  "Disclaimer": "Disclaimer",
  "Liability": "Liability for links",
  "imprint-p1": "Our offer contains links to external third-party websites over whose content we have no influence. We therefore cannot assume any liability for this external content. The respective provider or operator of the pages is always responsible for the content of the linked pages. The linked pages were checked for possible legal violations at the time of linking. Illegal content was not apparent at the time of linking. However, permanent control of the content of the linked pages is unreasonable without concrete evidence of a legal violation. If we become aware of any legal violations, we will immediately remove such links.",
  "copyright": "Copyright",
  "imprint-p2": "The content and works on these pages created by the site operators are subject to German copyright law. Reproduction, processing, distribution and any kind of exploitation outside the limits of copyright law require the written consent of the respective personAuthor or creator. Downloads and copies of this page are only forPrivate, non-commercial use permitted. As far as the contentThis site was not created by the operator, the copyrights remainThird party observed. In particular, third-party content is considered as suchmarked. If you still notice a copyright infringementIf you become aware of this, we ask you to inform us accordingly. AtIf we become aware of any legal violations, we will remove such content immediatelyremove.",
  "datenschutz": "Data protection",
  "imprint-p3": "It is generally possible to use our website without providing any personal data. As far as personal data (e.g. name, address or e-mail addresses) is collected on our pages, this is always done, as far as possible, on a voluntary basis. This data will not be passed on to third parties without your express consent.We would like to point out that data transmission over the Internet (e.g. when communicating via email) can have security gaps. Complete protection of data from access by third parties is not possible.The use of contact details published as part of the imprint obligation by third parties to send unsolicited advertising and information materials is hereby expressly prohibited. The operators of the pages expressly reserve the right to take legal action in the event of unsolicited advertising information being sent, such as spam emails.",
  "imprintFrom": "Imprint from",
  "of": "of",
  "content": "Table of contents",
  "response": "Responsible person",
  "processing": "Overview of processing",
  "processingText": "The following overview summarizes the types of data processed and the purposes of their processing and refers to the data subjects.",
  "processingText2": "Types of data processed",
  "processingLi1": "Bestandsdaten.",
  "processingLi2": "Contact details.",
  "processingLi3": "Content data.",
  "processingLi4": "Usage Data.",
  "processingLi5": "Meta, communication and procedural data.",
  "processingLi6": "Log data.",
  "processingText3": "Categories of data subjects",
  "processingLi7": "Communication partner.",
  "processingLi8": "User.",
  "processingText4": "Purposes of processing",
  "processingLi9": "Communication.",
  "processingLi10": "Safety measures.",
  "processingLi11": "Organizational and administrative procedures.",
  "processingLi12": "Provision of our online offering and user-friendliness.",
  "processingLi13": "Information technology infrastructure.",
  "processingText5": "Relevant legal bases according to the GDPR: Below you will find an overview of the legal bases of the GDPR on the basis of which we process personal data. Please note that in addition to the regulations of the GDPR, national data protection regulations may apply in your or our country of residence or domicile. If more specific legal bases apply in individual cases, we will inform you of these in the data protection declaration.",
  "CONSENT": "<li><strong>Consent (Art. 6 (1) sentence 1 lit. a) GDPR)</strong> - The data subject has given their consent to the processing of personal data concerning them for one or more specific purposes.</li>",
  "CONTRACT": "<li><strong>Performance of a contract and pre-contractual inquiries (Art. 6 (1) sentence 1 lit. b) GDPR)</strong> - Processing is necessary for the performance of a contract to which the data subject is party or in order to take steps at the request of the data subject prior to entering into a contract.</li>",
  "LEGITIMATE_INTERESTS": "<li><strong>Legitimate interests (Art. 6 (1) sentence 1 lit. f) GDPR)</strong> - Processing is necessary for the purposes of the legitimate interests pursued by the controller or by a third party, except where such interests are overridden by the interests or fundamental rights and freedoms of the data subject which require protection of personal data.</li>",
  "legalBases": "Relevant legal bases",
  "NATIONAL_DATA_PROTECTION_LAW": "<p><strong>National data protection regulations in Germany: </strong>In addition to the data protection regulations of the GDPR, national data protection regulations apply in Germany. This includes in particular the Federal Data Protection Act (BDSG). The BDSG contains special regulations on the right to information, the right to deletion, the right to object, the processing of special categories of personal data, processing for other purposes, and transmission as well as automated decision-making in individual cases including profiling. Furthermore, state data protection laws of the individual federal states may apply.</p>",
  "DSGVO_AND_SWISS_DSG": "<p><strong>Note on the application of GDPR and Swiss DSG: </strong>These data protection notices serve both for providing information according to the Swiss DSG and the General Data Protection Regulation (GDPR). For this reason, we ask you to note that the terms of the GDPR are used for broader spatial application and comprehensibility. In particular, instead of the terms used in the Swiss DSG \"processing\" of \"personal data\", \"overriding interest\" and \"sensitive personal data\", the terms \"processing\" of \"personal data\" as well as \"legitimate interest\" and \"special categories of data\" used in the GDPR are used. However, the legal meaning of the terms is still determined according to the Swiss DSG within the scope of the Swiss DSG.</p>",
  "DATA_DELETION_POLICY": "<p>We delete personal data that we process in accordance with legal regulations as soon as the underlying consents are revoked or no further legal grounds for processing exist. This concerns cases where the original processing purpose no longer applies or the data is no longer needed. Exceptions to this rule exist if legal obligations or special interests require longer retention or archiving of the data.</p><p>In particular, data that must be retained for commercial or tax reasons or whose storage is necessary for legal prosecution or to protect the rights of other natural or legal persons must be archived accordingly.</p><p>Our data protection notices contain additional information on the retention and deletion of data that specifically apply to certain processing processes.</p><p>If there are multiple specifications for the retention period or deletion deadlines of a date, the longest period is always decisive.</p><p>If a period does not explicitly begin on a specific date and is at least one year, it automatically starts at the end of the calendar year in which the event triggering the period occurred. In the case of ongoing contractual relationships in which data is stored, the event triggering the period is the date of the termination or other end of the legal relationship.</p><p>Data that is no longer processed for the originally intended purpose but is retained due to legal requirements or other reasons will only be processed for the reasons that justify its retention.</p><p><strong>Further information on processing procedures, processes, and services:</strong></p>",
  "dataStorageH2": "General information on data storage and deletion",
  "DATA_RETENTION": "<li><strong>Retention and Deletion of Data: </strong>The following general periods apply for retention and archiving under German law:<ul><li>10 years - Retention period for books and records, annual financial statements, inventories, management reports, opening balance sheets as well as the working instructions and other organizational documents required for their understanding, accounting records and invoices (§ 147 Abs. 3 i. V. m. Abs. 1 Nr. 1, 4 and 4a AO, § 14b Abs. 1 UStG, § 257 Abs. 1 Nr. 1 and 4, Abs. 4 HGB).</li><li>6 years - Other business documents: received commercial or business letters, copies of sent commercial or business letters, other documents, insofar as they are important for taxation, e.g., hourly wage slips, operating accounting sheets, calculation documents, price labels, but also payroll documents, insofar as they are not already accounting records and cash register strips (§ 147 Abs. 3 i. V. m. Abs. 1 Nr. 2, 3, 5 AO, § 257 Abs. 1 Nr. 2 and 3, Abs. 4 HGB).</li><li>3 years - Data required to consider potential warranty and compensation claims or similar contractual claims and rights as well as associated inquiries, based on past business experiences and common industry practices, are stored for the duration of the regular statutory limitation period of three years (§§ 195, 199 BGB).</li></ul></li>",
  "dataRights": "Rights of data subjects",
  "DSGVO_RIGHTS": "<p>Rights of the data subjects under the GDPR: As a data subject, you have various rights under the GDPR, which arise in particular from Art. 15 to 21 GDPR:</p><ul><li><strong>Right to object: You have the right to object at any time, for reasons arising from your particular situation, to the processing of personal data concerning you, which is carried out on the basis of Art. 6 para. 1 lit. e or f GDPR; this also applies to profiling based on these provisions. If personal data concerning you are processed for direct marketing purposes, you have the right to object at any time to the processing of personal data concerning you for such marketing purposes; this also applies to profiling insofar as it is associated with such direct marketing.</strong></li><li><strong>Right to withdraw consent:</strong> You have the right to withdraw your consent at any time.</li><li><strong>Right of access:</strong> You have the right to obtain confirmation as to whether data concerning you are being processed and to obtain information about such data as well as further information and a copy of the data in accordance with legal requirements.</li><li><strong>Right to rectification:</strong> You have the right, in accordance with legal requirements, to request the completion of the data concerning you or the rectification of inaccurate data concerning you.</li><li><strong>Right to erasure and restriction of processing:</strong> You have the right, in accordance with legal requirements, to request that data concerning you be deleted immediately, or alternatively, in accordance with legal requirements, to request a restriction of the processing of the data.</li><li><strong>Right to data portability:</strong> You have the right to receive the data concerning you, which you have provided to us, in a structured, commonly used and machine-readable format, in accordance with legal requirements, or to request the transfer of such data to another controller.</li><li><strong>Right to lodge a complaint with a supervisory authority:</strong> You have the right to lodge a complaint with a supervisory authority, in particular in the Member State of your habitual residence, place of work or place of the alleged infringement, if you consider that the processing of personal data concerning you violates the provisions of the GDPR, without prejudice to any other administrative or judicial remedy.</li></ul>",
  "webhosting": "Provision of the online offering and web hosting",
  "DATA_PROCESSING": "<p>We process user data to provide them with our online services. For this purpose, we process the user's IP address, which is necessary to transmit the contents and functions of our online services to the user's browser or device.</p><ul class=\"m-elements\"><li><strong>Types of data processed:</strong> Usage data (e.g., page views and time spent, click paths, usage intensity and frequency, types of devices and operating systems used, interactions with content and functions); meta, communication, and procedural data (e.g., IP addresses, timestamps, identification numbers, involved persons); log data (e.g., log files regarding logins or data retrieval or access times). Content data (e.g., text or image messages and posts, and the information relating to them, such as authorship details or creation time).</li><li><strong>Data subjects:</strong> Users (e.g., website visitors, users of online services).</li><li><strong>Purposes of processing:</strong> Provision of our online offer and user-friendliness; IT infrastructure (operation and provision of information systems and technical devices (computers, servers, etc.)). Security measures.</li><li><strong>Retention and deletion:</strong> Deletion according to the information in the section \"General information on data retention and deletion\".</li><li class=\"\"><strong>Legal basis:</strong> Legitimate interests (Art. 6 para. 1 sentence 1 lit. f) GDPR).</li></ul><p><strong>Further information on processing operations, procedures and services:</strong></p><ul class=\"m-elements\"><li><strong>Collection of access data and log files: </strong>Access to our online offer is logged in the form of so-called \"server log files\". The server log files can include the address and name of the retrieved websites and files, date and time of retrieval, transferred data volumes, messages about successful retrieval, browser type and version, the user's operating system, referrer URL (the previously visited page), and, as a rule, IP addresses and the requesting provider. The server log files can be used for security purposes, e.g., to prevent server overloads (especially in the case of abusive attacks, so-called DDoS attacks), and to ensure the stability and load of the servers; <span class=\"\"><strong>Legal basis:</strong> Legitimate interests (Art. 6 para. 1 sentence 1 lit. f) GDPR). </span><strong>Deletion of data:</strong> Log file information is stored for a maximum of 30 days and then deleted or anonymized. Data that must be retained for evidence purposes are excluded from deletion until the respective incident has been finally clarified.</li><li><strong>Email transmission and hosting: </strong>The web hosting services we use also include the sending, receiving, and storage of emails. For these purposes, the addresses of the recipients and senders as well as other information concerning the email transmission (e.g., the involved providers) and the contents of the respective emails are processed. The aforementioned data may also be processed for SPAM detection purposes. Please note that emails are generally not sent encrypted on the internet. Emails are usually encrypted in transit, but not on the servers from which they are sent and received (unless end-to-end encryption is used). Therefore, we cannot take responsibility for the transmission path of the emails between the sender and the reception on our server; <span class=\"\"><strong>Legal basis:</strong> Legitimate interests (Art. 6 para. 1 sentence 1 lit. f) GDPR).</span></li><li><strong>ALL-INKL: </strong>Services in the field of providing IT infrastructure and related services (e.g., storage space and/or computing capacities); <strong>Service provider:</strong> ALL-INKL.COM - Neue Medien Münnich, Owner: René Münnich, Hauptstraße 68, 02742 Friedersdorf, Germany; <span class=\"\"><strong>Legal basis:</strong> Legitimate interests (Art. 6 para. 1 sentence 1 lit. f) GDPR); </span><strong>Website:</strong> <a href=\"https://all-inkl.com/\" target=\"_blank\">https://all-inkl.com/</a>; <strong>Privacy policy:</strong> <a href=\"https://all-inkl.com/datenschutzinformationen/\" target=\"_blank\">https://all-inkl.com/datenschutzinformationen/</a>. <strong>Order processing contract:</strong> Provided by the service provider.</li></ul>",
  "cookiesUse": "Use of cookies",
  "COOKIES_INFO": "<p>Cookies are small text files or other storage notes that store and read information on end devices. For example, to store the login status in a user account, a shopping cart content in an e-shop, the accessed content or used functions of an online offer. Cookies can also be used for different purposes, such as the functionality, security, and comfort of online offers, as well as the creation of analyses of visitor flows.</p><p><strong>Notes on consent: </strong>We use cookies in accordance with legal regulations. Therefore, we obtain prior consent from users unless it is not required by law. Permission is not required, in particular, if storing and reading the information, including cookies, is absolutely necessary to provide users with a telemedia service (i.e., our online offer) explicitly requested by them. The revocable consent is clearly communicated to them and contains the information about the respective cookie usage.</p><p><strong>Notes on data protection legal bases: </strong>The legal basis on which we process the users' personal data using cookies depends on whether we ask users for consent. If users agree, the legal basis for processing their data is the declared consent. Otherwise, the data processed using cookies is based on our legitimate interests (e.g., in the economic operation of our online offer and its improvement of usability) or, if this is done in the context of fulfilling our contractual obligations, if the use of cookies is necessary to meet our contractual obligations. We clarify the purposes for which cookies are processed by us in the course of this privacy policy or as part of our consent and processing procedures.</p><p><strong>Storage duration: </strong>With regard to the storage duration, the following types of cookies are distinguished:</p><ul><li><strong>Temporary cookies (also: session or session cookies):</strong> Temporary cookies are deleted at the latest after a user has left an online offer and closed their end device (e.g., browser or mobile application).</li><li><strong>Permanent cookies:</strong> Permanent cookies remain stored even after the end device has been closed. For example, the login status can be saved and preferred content displayed directly when the user visits a website again. Likewise, the user data collected with the help of cookies can be used for reach measurement. Unless we provide users with explicit information about the type and storage duration of cookies (e.g., as part of obtaining consent), they should assume that these are permanent and the storage duration can be up to two years.</li></ul><p><strong>General information on withdrawal and objection (opt-out): </strong>Users can revoke their consent at any time and also object to the processing in accordance with the legal requirements, also using the privacy settings of their browser.</p><ul class=\"m-elements\"><li><strong>Types of data processed:</strong> Meta, communication, and procedural data (e.g., IP addresses, timestamps, identification numbers, involved persons).</li><li><strong>Persons affected:</strong> Users (e.g., website visitors, users of online services).</li><li class=\"\"><strong>Legal bases:</strong> Legitimate interests (Art. 6 para. 1 sentence 1 lit. f) GDPR). Consent (Art. 6 para. 1 sentence 1 lit. a) GDPR).</li></ul><p><strong>Further notes on processing, procedures, and services:</strong></p><ul class=\"m-elements\"><li><strong>Processing of cookie data based on consent: </strong>We use a consent management solution in which users' consent to the use of cookies or the procedures and providers mentioned in the consent management solution is obtained. This procedure is used to obtain, record, manage, and revoke consents, particularly concerning the use of cookies and similar technologies used to store, read, and process information on users' end devices. As part of this procedure, the users' consents to the use of cookies and the associated processing of information, including the specific processing and providers mentioned in the consent management process, are obtained. Users also have the option to manage and revoke their consents. The consent declarations are stored to avoid repeated requests and to provide proof of consent in accordance with legal requirements. Storage is server-side and/or in a cookie (so-called opt-in cookie) or by using comparable technologies to be able to assign the consent to a specific user or their device. Unless specific information about the providers of consent management services is available, the following general information applies: The duration of consent storage is up to two years. A pseudonymous user identifier is created, which is stored together with the time of consent, information on the scope of consent (e.g., categories of cookies and/or service providers involved), as well as information about the browser, system, and end device used; <span class=\"\"><strong>Legal bases:</strong> Consent (Art. 6 para. 1 sentence 1 lit. a) GDPR).</span></li></ul>",
  "contactManagement": "Contact and inquiry management",
  "CONTACT_INFO": "<p>When contacting us (e.g., by mail, contact form, email, phone, or via social media) and within the framework of existing user and business relationships, the information of the requesting persons is processed to the extent necessary to respond to the contact requests and any requested measures.</p><ul class=\"m-elements\"><li><strong>Types of data processed:</strong> Inventory data (e.g., full name, home address, contact information, customer number, etc.); contact data (e.g., postal and email addresses or phone numbers); content data (e.g., textual or visual messages and contributions and the information concerning them, such as authorship information or time of creation); usage data (e.g., page views and length of stay, click paths, usage intensity and frequency, device types and operating systems used, interactions with content and functions). Meta-, communication- and procedural data (e.g., IP addresses, timestamps, identification numbers, involved persons).</li><li><strong>Persons affected:</strong> Communication partners.</li><li><strong>Purposes of processing:</strong> Communication; organizational and administrative procedures; feedback (e.g., collecting feedback via online form). Provision of our online offer and user-friendliness.</li><li><strong>Retention and deletion:</strong> Deletion according to the information in the section \"General information on data storage and deletion\".</li><li class=\"\"><strong>Legal bases:</strong> Legitimate interests (Art. 6 para. 1 sentence 1 lit. f) GDPR). Fulfillment of contract and pre-contractual inquiries (Art. 6 para. 1 sentence 1 lit. b) GDPR).</li></ul><p><strong>Further notes on processing, procedures, and services:</strong></p><ul class=\"m-elements\"><li><strong>Contact form: </strong>When contacting us via our contact form, email, or other communication methods, we process the personal data transmitted to us to respond to and handle the respective request. This usually includes information such as name, contact information, and possibly other information communicated to us and required for proper handling. We use this data exclusively for the specified purpose of contact and communication; <span class=\"\"><strong>Legal bases:</strong> Fulfillment of contract and pre-contractual inquiries (Art. 6 para. 1 sentence 1 lit. b) GDPR), Legitimate interests (Art. 6 para. 1 sentence 1 lit. f) GDPR).</span></li></ul>",
  "DatenschutzLink": "Created with the free Data Protection Generator.de by Dr. Thomas Schwenke",
  "ImgOf": "Image of",
  "auf": "on"

}